# StandardBendDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BarTypeDiameterOptions..::..StandardBendDiameter Property
BarTypeDiameterOptions Class See Also
---
Represents the standard bar bend diameter of the RebarBarType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public double StandardBendDiameter { get; set; }
```

Visual Basic
---
```text
Public Property StandardBendDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double StandardBendDiameter {
	double get ();
	void set (double value);
}
```

# See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace